released/M480BSP_SPI_FLASH_PDMA/SampleCode/Template/main.c
   // /CS: active
    QSPI_SET_SS_LOW(SPI_FLASH_PORT);

    // send Command: 0x06, Write enable
    QSPI_WRITE_TX(SPI_FLASH_PORT, 0x06);

    // wait tx finish
    while(QSPI_IS_BUSY(SPI_FLASH_PORT));

    // /CS: de-active
    QSPI_SET_SS_HIGH(SPI_FLASH_PORT);


    // /CS: active
    QSPI_SET_SS_LOW(SPI_FLASH_PORT);

    // send Command: 0x02, Page program
    QSPI_WRITE_TX(SPI_FLASH_PORT, 0x02);

    // send 24-bit start address
    QSPI_WRITE_TX(SPI_FLASH_PORT, (StartAddress>>16) & 0xFF);
    QSPI_WRITE_TX(SPI_FLASH_PORT, (StartAddress>>8)  & 0xFF);
    QSPI_WRITE_TX(SPI_FLASH_PORT, StartAddress       & 0xFF);


    // write data
	if (EnablePDMA)
	{
		SPI_Master_TX_PDMA(u8DataBuffer , SPI_FLASH_PAGE_BYTE);
	}
	else
	{
	    while(1)
	    {
	        if(!QSPI_GET_TX_FIFO_FULL_FLAG(SPI_FLASH_PORT))
	        {
//				printf("%3d\r\n" , i);			
	            QSPI_WRITE_TX(SPI_FLASH_PORT, u8DataBuffer[i]);
	            if (i++ >= (SPI_FLASH_PAGE_BYTE-1) )
					break;				
	        }
	    }
	}

    // wait tx finish
    while(QSPI_IS_BUSY(SPI_FLASH_PORT));

    // /CS: de-active
    QSPI_SET_SS_HIGH(SPI_FLASH_PORT);

    QSPI_ClearRxFIFO(SPI_FLASH_PORT);


	#else
	
    // /CS: active
    SPI_SET_SS_LOW(SPI_FLASH_PORT);

    // send Command: 0x06, Write enable
    SPI_WRITE_TX(SPI_FLASH_PORT, 0x06);

    // wait tx finish
    while(SPI_IS_BUSY(SPI_FLASH_PORT));

    // /CS: de-active
    SPI_SET_SS_HIGH(SPI_FLASH_PORT);


    // /CS: active
    SPI_SET_SS_LOW(SPI_FLASH_PORT);

    // send Command: 0x02, Page program
    SPI_WRITE_TX(SPI_FLASH_PORT, 0x02);

    // send 24-bit start address
    SPI_WRITE_TX(SPI_FLASH_PORT, (StartAddress>>16) & 0xFF);
    SPI_WRITE_TX(SPI_FLASH_PORT, (StartAddress>>8)  & 0xFF);
    SPI_WRITE_TX(SPI_FLASH_PORT, StartAddress       & 0xFF);


    // write data
	if (EnablePDMA)
	{
		SPI_Master_TX_PDMA(u8DataBuffer , SPI_FLASH_PAGE_BYTE);
	}
	else
	{
	    while(1)
	    {
	        if(!SPI_GET_TX_FIFO_FULL_FLAG(SPI_FLASH_PORT))
	        {
//				printf("%3d\r\n" , i);			
	            SPI_WRITE_TX(SPI_FLASH_PORT, u8DataBuffer[i]);
	            if (i++ >= (SPI_FLASH_PAGE_BYTE-1) )
					break;				
	        }
	    }
	}

    // wait tx finish
    while(SPI_IS_BUSY(SPI_FLASH_PORT));

    // /CS: de-active
    SPI_SET_SS_HIGH(SPI_FLASH_PORT);

    SPI_ClearRxFIFO(SPI_FLASH_PORT);
	#endif
}

void SpiFlash_PageWrite(uint32_t page_no, uint8_t *u8DataBuffer , uint8_t EnablePDMA)
{
	SpiFlash_NormalPageProgram(page_no*SPI_FLASH_PAGE_BYTE , u8DataBuffer , EnablePDMA);
	SpiFlash_WaitReady();
}

void SpiFlash_NormalRead(uint32_t StartAddress, uint8_t *u8DataBuffer , uint8_t EnablePDMA)
{
    uint32_t i = 0;

	#if defined (M487_EVM_SPI_FLASH)
   // /CS: active
    QSPI_SET_SS_LOW(SPI_FLASH_PORT);

    // send Command: 0x03, Read data
    QSPI_WRITE_TX(SPI_FLASH_PORT, 0x03);

    // send 24-bit start address
    QSPI_WRITE_TX(SPI_FLASH_PORT, (StartAddress>>16) & 0xFF);
    QSPI_WRITE_TX(SPI_FLASH_PORT, (StartAddress>>8)  & 0xFF);
    QSPI_WRITE_TX(SPI_FLASH_PORT, StartAddress       & 0xFF);

    while(QSPI_IS_BUSY(SPI_FLASH_PORT));
    // clear RX buffer
    QSPI_ClearRxFIFO(SPI_FLASH_PORT);

    // read data
    if (EnablePDMA)
    {
		SPI_Master_RX_PDMA(u8DataBuffer , SPI_FLASH_PAGE_BYTE);
    }
	else
	{
	    for(i = 0 ; i < SPI_FLASH_PAGE_BYTE ; i++)
	    {
	        QSPI_WRITE_TX(SPI_FLASH_PORT, 0x00);
	        while(QSPI_IS_BUSY(SPI_FLASH_PORT));
	        u8DataBuffer[i] = QSPI_READ_RX(SPI_FLASH_PORT);
	    }
	}

    // wait tx finish
    while(QSPI_IS_BUSY(SPI_FLASH_PORT));

    // /CS: de-active
    QSPI_SET_SS_HIGH(SPI_FLASH_PORT);

	#else

    // /CS: active
    QSPI_SET_SS_LOW(SPI_FLASH_PORT);

    // send Command: 0x03, Read data
    QSPI_WRITE_TX(SPI_FLASH_PORT, 0x03);

    // send 24-bit start address
    QSPI_WRITE_TX(SPI_FLASH_PORT, (StartAddress>>16) & 0xFF);
    QSPI_WRITE_TX(SPI_FLASH_PORT, (StartAddress>>8)  & 0xFF);
    QSPI_WRITE_TX(SPI_FLASH_PORT, StartAddress       & 0xFF);

    while(QSPI_IS_BUSY(SPI_FLASH_PORT));
    // clear RX buffer
    QSPI_ClearRxFIFO(SPI_FLASH_PORT);

    // read data
    if (EnablePDMA)
    {
		SPI_Master_RX_PDMA(u8DataBuffer , SPI_FLASH_PAGE_BYTE);
    }
	else
	{
	    for(i = 0 ; i < SPI_FLASH_PAGE_BYTE ; i++)
	    {
	        QSPI_WRITE_TX(SPI_FLASH_PORT, 0x00);
	        while(QSPI_IS_BUSY(SPI_FLASH_PORT));
	        u8DataBuffer[i] = QSPI_READ_RX(SPI_FLASH_PORT);
	    }
	}

    // wait tx finish
    while(QSPI_IS_BUSY(SPI_FLASH_PORT));

    // /CS: de-active
    QSPI_SET_SS_HIGH(SPI_FLASH_PORT);
	#endif

	
}

void SpiFlash_PageRead(uint32_t page_no, uint8_t *u8DataBuffer , uint8_t EnablePDMA)
{
	SpiFlash_NormalRead(page_no*SPI_FLASH_PAGE_BYTE , u8DataBuffer , EnablePDMA);
}

/*
TARGET
	SPI SS : PB.15
	SPI CLK : PB.14		
	SPI MISO : PB.13	
	SPI MOSI : PB.12	

SAMPLE CODE
	SPI SS : PA.3	
	SPI CLK : PA.2			
	SPI MISO : PA.1		
	SPI MOSI : PA.0	
    
*/

void SpiFlash_Init(void)
{
    uint16_t u16ID = 0;
    uint16_t i = 0;


	#if defined (M487_EVM_SPI_FLASH)	//PC4 , PC5 pull high
	GPIO_SetMode(PC, (BIT4 | BIT5) ,GPIO_MODE_OUTPUT);
	PC4 = 1;
	PC5 = 1;	
	TIMER_Delay(TIMER0, 1000);	
	#endif

	#if defined (M487_EVM_SPI_FLASH)
    /* Configure SPI_FLASH_PORT as a master, MSB first, 8-bit transaction, SPI Mode-0 timing, clock is 20MHz */
    QSPI_Open(SPI_FLASH_PORT, SPI_MASTER, SPI_MODE_0, 8, SPI_CLK_FREQ);

    /* Disable auto SS function, control SS signal manually. */
    QSPI_DisableAutoSS(SPI_FLASH_PORT);
    QSPI_SET_SS_HIGH(SPI_FLASH_PORT);

	#else
    /* Configure SPI_FLASH_PORT as a master, MSB first, 8-bit transaction, SPI Mode-0 timing, clock is 20MHz */
    SPI_Open(SPI_FLASH_PORT, SPI_MASTER, SPI_MODE_0, 8, SPI_CLK_FREQ);

    /* Disable auto SS function, control SS signal manually. */
    SPI_DisableAutoSS(SPI_FLASH_PORT);
    SPI_SET_SS_HIGH(SPI_FLASH_PORT);
	#endif

	/*
		W25Q32JV : 0xEF15
	*/
	u16ID = SpiFlash_ReadMidDid();
	printf("ID : 0x%2X\r\n" , u16ID);

	
	//initial TX , RX data
    for (i=0; i < SPI_FLASH_PAGE_BYTE; i++)
    {
        TxBuffer[i] = 0xFF;
        RxBuffer[i] = 0xFF;
    }

