released/M480BSP_SPI_FLASH_PDMA/SampleCode/Template/main.c
}

void UARTx_Process(void)
{
	uint8_t res = 0;
    uint16_t i = 0;
	static uint8_t cnt = 0;
    uint16_t page_cnt = 0;
	
	res = UART_READ(UART0);

	if (res > 0x7F)
	{
		printf("invalid command\r\n");
	}
	else
	{
		switch(res)
		{
			case '?':

				printf("\r\n==========================\r\n");
				
				printf("1: chip erase\r\n");
				printf("2: fill in TX data\r\n");
				printf("3: page counter\r\n");
				printf("4: Page write\r\n");
				printf("5: Page read\r\n");		
				printf("6: self test , write , read , compare\r\n");	
				printf("7: self test , write , read , compare  , with PDMA\r\n");
				
				printf("8: read ID (0x90)\r\n");	
				
				printf("==========================\r\n\r\n");
				break;	

		
			case '1':
				printf("perform SpiFlash_ChipErase\r\n");
				
			    /* Erase SPI flash */
			    SpiFlash_ChipErase();

			    /* Wait ready */
			    SpiFlash_WaitReady();

				printf("erase finish\r\n\r\n");
				break;	

			case '2':
				printf("increase test data start from 0x%2X\r\n" , cnt);

				//reset TxBuffer
				reset_buffer(TxBuffer,SPI_FLASH_PAGE_BYTE);

				//fill in data
			    for ( i = 0; i < SPI_FLASH_PAGE_BYTE; i++)
			    {
			        TxBuffer[i] = 0x00 + i + cnt;
			    }

				printf("TxBuffer : \r\n");
				dump_buffer_hex(TxBuffer,SPI_FLASH_PAGE_BYTE);				
				cnt++; 
			
				break;

			case '3':
				printf("SPI_FLASH_page_counter current : 0x%2X\r\n\r\n" ,SPI_FLASH_page_counter++);	
			
				break;

			case '4':
				printf("programming...\r\n");
				SpiFlash_PageWrite(SPI_FLASH_page_counter,TxBuffer,DISABLE);
				printf("programming finish\r\n\r\n");
				
				break;

			case '5':
				//reset RxBuffer
			    reset_buffer(RxBuffer,SPI_FLASH_PAGE_BYTE);

				printf("read page ...\r\n");
				SpiFlash_PageRead(SPI_FLASH_page_counter,RxBuffer,DISABLE);
				dump_buffer_hex(RxBuffer,SPI_FLASH_PAGE_BYTE);				
				printf("read page finish\r\n\r\n");	
				
				break;				

			case '6':
				//reset RxBuffer
			    reset_buffer(RxBuffer,SPI_FLASH_PAGE_BYTE);

				printf("perform SpiFlash_ChipErase\r\n");
				
			    /* Erase SPI flash */
			    SpiFlash_ChipErase();

			    /* Wait ready */
			    SpiFlash_WaitReady();

				printf("erase finish\r\n\r\n");

				for ( page_cnt = 0 ; page_cnt < TEST_NUMBER ; page_cnt++)
				{
					printf("\r\nSELF TEST ... (page : %2d)\r\n" , page_cnt);

					//reset TxBuffer
					reset_buffer(TxBuffer,SPI_FLASH_PAGE_BYTE);

					//fill in data
				    for ( i = 0; i < SPI_FLASH_PAGE_BYTE; i++)
				    {
				        TxBuffer[i] = 0x00 + i + cnt;
				    }

//					printf("\r\nTxBuffer : \r\n");
//					dump_buffer_hex(TxBuffer,SPI_FLASH_PAGE_BYTE);				
					cnt++;
					
					SpiFlash_PageWrite(page_cnt,TxBuffer,DISABLE);
					SpiFlash_PageRead(page_cnt,RxBuffer,DISABLE);

//					printf("\r\nRxBuffer\r\n");
//					dump_buffer_hex(RxBuffer,SPI_FLASH_PAGE_BYTE);		

					compare_buffer(TxBuffer,RxBuffer,SPI_FLASH_PAGE_BYTE);
				}

				printf("SELF TEST finish\r\n\r\n");	
			
				break;	


			case '7':

				//reset RxBuffer
			    reset_buffer(RxBuffer,SPI_FLASH_PAGE_BYTE);

				printf("perform SpiFlash_ChipErase\r\n");
				
			    /* Erase SPI flash */
			    SpiFlash_ChipErase();

			    /* Wait ready */
			    SpiFlash_WaitReady();

				printf("erase finish\r\n\r\n");

				for ( page_cnt = 0 ; page_cnt < TEST_NUMBER ; page_cnt++)
				{
					printf("\r\nPDMA SELF TEST ... (page : %2d)\r\n" , page_cnt);

					//reset TxBuffer
					reset_buffer(TxBuffer,SPI_FLASH_PAGE_BYTE);

					//fill in data
				    for ( i = 0; i < SPI_FLASH_PAGE_BYTE; i++)
				    {
				        TxBuffer[i] = 0x00 + i + cnt;
				    }

//					printf("\r\nTxBuffer : \r\n");
//					dump_buffer_hex(TxBuffer,SPI_FLASH_PAGE_BYTE);				
					cnt++;
					
					SpiFlash_PageWrite(page_cnt,TxBuffer,ENABLE);
					SpiFlash_PageRead(page_cnt,RxBuffer,ENABLE);

//					printf("\r\nRxBuffer\r\n");
//					dump_buffer_hex(RxBuffer,SPI_FLASH_PAGE_BYTE);		

					compare_buffer(TxBuffer,RxBuffer,SPI_FLASH_PAGE_BYTE);
				}

				printf("PDMA SELF TEST finish\r\n\r\n");	

				break;

			case '8':			
				i = SpiFlash_ReadMidDid();
				printf("SpiFlash_ReadMidDid : 0x%2X\r\n\n" , i);
				
				break;

			case 'X':
			case 'x':
			case 'Z':
			case 'z':
				NVIC_SystemReset();
			
				break;		
			
		}
	}
}

void UART0_IRQHandler(void)
{
    if(UART_GET_INT_FLAG(UART0, UART_INTSTS_RDAINT_Msk | UART_INTSTS_RXTOINT_Msk))     /* UART receive data available flag */
    {
        while(UART_GET_RX_EMPTY(UART0) == 0)
        {
//			set_flag(flag_uart_rx,ENABLE);
			UARTx_Process();
        }
    }

    if(UART0->FIFOSTS & (UART_FIFOSTS_BIF_Msk | UART_FIFOSTS_FEF_Msk | UART_FIFOSTS_PEF_Msk | UART_FIFOSTS_RXOVIF_Msk))
    {
        UART_ClearIntFlag(UART0, (UART_INTSTS_RLSINT_Msk| UART_INTSTS_BUFERRINT_Msk));
    }
}

void UART0_Init(void)
{
    SYS_ResetModule(UART0_RST);

    /* Configure UART0 and set UART0 baud rate */
    UART_Open(UART0, 115200);

	/* Set UART receive time-out */
	UART_SetTimeoutCnt(UART0, 20);

	UART0->FIFO &= ~UART_FIFO_RFITL_4BYTES;
	UART0->FIFO |= UART_FIFO_RFITL_8BYTES;

	/* Enable UART Interrupt - */
	UART_ENABLE_INT(UART0, UART_INTEN_RDAIEN_Msk | UART_INTEN_TOCNTEN_Msk | UART_INTEN_RXTOIEN_Msk);
	
	NVIC_EnableIRQ(UART0_IRQn);

	printf("\r\nCLK_GetCPUFreq : %8d\r\n",CLK_GetCPUFreq());
	printf("CLK_GetHXTFreq : %8d\r\n",CLK_GetHXTFreq());
	printf("CLK_GetLXTFreq : %8d\r\n",CLK_GetLXTFreq());	
	printf("CLK_GetPCLK0Freq : %8d\r\n",CLK_GetPCLK0Freq());
	printf("CLK_GetPCLK1Freq : %8d\r\n",CLK_GetPCLK1Freq());	
}

void TMR1_IRQHandler(void)
{
	static uint16_t CNT = 0;	
	static uint32_t log = 0;	
	
    if(TIMER_GetIntFlag(TIMER1) == 1)
    {
        TIMER_ClearIntFlag(TIMER1);
	
		if (CNT++ > 1000)
		{		
			CNT = 0;
//			printf("%s : %2d\r\n" , __FUNCTION__ , log++);

			LED_G ^= 1;
		}
    }
}

void TIMER1_HW_Init(void)
{
    CLK_EnableModuleClock(TMR1_MODULE);
    CLK_SetModuleClock(TMR1_MODULE, CLK_CLKSEL1_TMR1SEL_HIRC, 0);
}

void TIMER1_Init(void)
{
    TIMER_Open(TIMER1, TIMER_PERIODIC_MODE, 1000);
    TIMER_EnableInt(TIMER1);
    NVIC_EnableIRQ(TMR1_IRQn);	
    TIMER_Start(TIMER1);
}

void TIMER0_HW_Init(void)
{
	CLK_EnableModuleClock(TMR0_MODULE);
	CLK_SetModuleClock(TMR0_MODULE, CLK_CLKSEL1_TMR0SEL_PCLK0, 0);
}

void TIMER0_Polling(uint32_t u32Usec)
{
	TIMER_Delay(TIMER0, u32Usec);
}

void LED_Init(void)
{
	GPIO_SetMode(PH,BIT0,GPIO_MODE_OUTPUT);
	GPIO_SetMode(PH,BIT1,GPIO_MODE_OUTPUT);
	GPIO_SetMode(PH,BIT2,GPIO_MODE_OUTPUT);
	
